app/Controllers/Admin/AdminController.php

SELECT COUNT(*) AS `numrows`
FROM `post`
SELECT COUNT(*) AS `numrows`
FROM `post`
WHERE `post_cate_slug` = 'blog'
SELECT COUNT(*) AS `numrows`
FROM `post`
WHERE `post_status` = 'san-pham'
SELECT *
FROM `post`
ORDER BY `post_view` DESC
 LIMIT 5
SELECT *
FROM `post`
ORDER BY `updated_at` DESC
 LIMIT 3
SELECT *
FROM `post`
ORDER BY `time_view_newest` DESC
 LIMIT 3
SELECT SUM(`post_view`) AS `post_view`
FROM `post`
---
    public function index()
    {
        $galleryModel = new GalleryModel();
        $postModel = new postModel();

        $data['totalGallery'] = $galleryModel->countAllResults();
        $data['totalPost'] = $postModel->countAllResults();
        $data['totalBlog'] = $postModel->where('post_cate_slug', 'blog')->countAllResults();
        $data['totalProduct'] = $postModel->where('post_status', 'san-pham')->countAllResults();

        $data['postMostView'] = $postModel->orderBy('post_view', 'DESC')->limit(5)->find();
        $data['imageMostView'] = $galleryModel->orderBy('gallery_view', 'DESC')->limit(5)->find();

        $data['postRecent'] = $postModel->orderBy('updated_at', 'DESC')->limit(3)->find();
        $data['imageRecent'] = $galleryModel->orderBy('updated_at', 'DESC')->limit(12)->find();


        $data['postRecentView'] = $postModel->orderBy('time_view_newest', 'DESC')->limit(3)->find();
        $data['imageRecentView'] = $galleryModel->orderBy('time_view_newest', 'DESC')->limit(12)->find();


        $data['totalPostView'] = $postModel->selectSum('post_view')->findAll();