app/Controllers/Admin/Auth.php

            // $password = Hash::make($password);

            $usersModel = new \App\Models\usersModel();
            $user_info = $usersModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'phuth.site@gmail.com'
 LIMIT 1

    public function getEdit(){

        $usersModel = new \App\Models\usersModel();
        $loggerUserID = session()->get('loggedUser');
        $data['userInfo'] = $usersModel->find($loggerUserID);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '17'