app/Controllers/Admin/CarouselController.php

SELECT *
FROM `carousel`
ORDER BY `id` DESC
---
    public function index(){
        $carouselModel = new CarouselModel();
        $data['carousel'] = $carouselModel->orderBy('id', 'DESC')->findAll();