app/Controllers/Admin/GalleryController.php

    public function index(){
        $galleryModel = new GalleryModel();
        $data['gallery'] = $galleryModel->orderBy('id', 'DESC')->findAll();

        $cateModel = new CateModel();
        $data['cate'] = $cateModel->where('cate_type', 'cate_gallery')->first();
---
SELECT *
FROM `gallery`
ORDER BY `id` DESC
SELECT *
FROM `cate`
WHERE `cate_type` = 'cate_gallery'
 LIMIT 1