app/Controllers/Admin/PostController.php

    public function index(){
        $postModel = new PostModel();
        $data['post'] = $postModel->orderBy('id', 'DESC')->findAll();

        $cateModel = new CateModel();
        $data['cate'] = $cateModel->findAll();
---
SELECT *
FROM `cate`

    public function SaveEdit($id)
    {
        // $this->validate();
        // dd($id);
        $postModel = new PostModel();
        $cateModel = new CateModel();
        $tagModel = new TagModel();
        $data['cate'] = $cateModel->findAll();

        $tagList = $tagModel->where('tag_post_id', $id)->get()->getResultArray();
        // dd($tagList);
        $data['tagModel'] = $tagModel->where('tag_post_id', $id)->get()->getResultArray();
        $detailPost = $postModel->find($id);
---
SELECT *
FROM `cate`
SELECT *
FROM `tag`
WHERE `tag_post_id` = '48'
SELECT *
FROM `post`
WHERE `post`.`id` = '48'

        $data['post_view']      = $detailPost['post_view'];
        $data['post_show']      = $detailPost['post_show'];

        $cate_slug = $cateModel->where('id', $this->request->getPost('post_cate_id'))->first();
---
SELECT *
FROM `cate`
WHERE `id` = '8'
 LIMIT 1




        $postModel->update($id, $data);
---
UPDATE `post` SET `post_title` = 'Hóa đơn báo biểu', `post_slug` = 'hoa-don-bao-bieu', `post_intro` = '- 50 Cặp\r\n- 100 tờ\r\n- Số lượng order: từ 10 cuốn', `post_content` = '<p>Cam kết cung cấp số lượng lớn v&agrave; số lượng từ 10 cuốn với thời gian nhanh nhất</p>', `post_cate_id` = '8', `post_featured` = '0', `post_status` = 'san-pham', `post_meta_desc` = 'hóa đơn viết tay, hóa đơn bán lẻ cung cấp sản phẩm lớn cho khách hàng cá nhân hoặc doanh nghiệp', `post_meta_key` = 'hóa đơn viết tay, hóa đơn bán lẻ', `post_view` = '14', `post_show` = '1', `post_cate_name` = 'In Nhanh Hóa Đơn', `post_cate_slug` = 'in-nhanh-hoa-don', `post_price` = '21000', `post_sale` = '0', `post_image` = 'hoa-don-bao-bieu-XfaE7PoVkGAsMdwI.jpg', `updated_at` = '2023-09-20 12:10:47'
WHERE `post`.`id` IN ('48')

        $post_tag = $this->request->getPost('taginput');
        $post_tag = json_decode($post_tag, true);

        $tagId = $tagModel->where('tag_post_id', $id)->first();
---
SELECT *
FROM `tag`
WHERE `tag_post_id` = '48'
 LIMIT 1