app/Controllers/Admin/PostController.php

    public function index(){
        $postModel = new PostModel();
        $data['post'] = $postModel->findAll();
---
SELECT *
FROM `post`

    public function getEdit($id){
        $postModel = new PostModel();
        $cateModel = new CateModel();
        $tagModel = new TagModel();
        $data['cate'] = $cateModel->findAll();
        $data['postDetail'] = $postModel->find($id);
        $data['tagModel'] = $tagModel->where('tag_post_id', $id)->get()->getResultArray();
---
SELECT *
FROM `cate`
SELECT *
FROM `post`
WHERE `post`.`id` = '33'
SELECT *
FROM `tag`
WHERE `tag_post_id` = '33'