app/Controllers/BaseController.php

    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        // Do Not Edit This Line
        parent::initController($request, $response, $logger);
        $session = \Config\Services::session();

        // Preload any models, libraries, etc, here.

        // E.g.: $this->session = \Config\Services::session();
        $uri = service('uri');
        if($uri->getSegment(1) === "admin" || $uri->getSegment(1) === "auth"){
            $usersModel = new usersModel();
            $loggerUserID = session()->get('loggedUser');
            $userInfo = $usersModel->find($loggerUserID);
            $dataLogin = ['userinfo'=> $userInfo, 'loggerUserID' => $loggerUserID];
            $cateModel = new \App\Models\CateModel();
            $dataLogin['cate'] = $cateModel->orderBy('cate_type', 'DESC')->findAll();
            return view('admin/admin-layout', $dataLogin);
        }else{

            $cateModel = new \App\Models\CateModel();
            $data2['cate'] = $cateModel->orderBy('cate_type', 'DESC')->findAll();
            $pageModel = new PageModel();
            $data2['page_home'] = $pageModel->where('page_status', 1)->first();
            $data2['link_page'] = $pageModel->where('page_status !=', 1)->where('page_show', 1)->findAll();
---
SELECT *
FROM `users`
SELECT *
FROM `users`
WHERE `users`.`id` = '17'
SELECT *
FROM `cate`
ORDER BY `cate_type` DESC
SELECT *
FROM `page`
WHERE `page_status` = 1
 LIMIT 1
SELECT *
FROM `page`
WHERE `page_status` != 1
AND `page_show` = 1