app/Controllers/BaseController.php

SELECT *
FROM `cate`
---
    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        // Do Not Edit This Line
        parent::initController($request, $response, $logger);

        // Preload any models, libraries, etc, here.

        // E.g.: $this->session = \Config\Services::session();
        $usersModel = new \App\Models\usersModel();
        $loggerUserID = session()->get('loggedUser');
        $userInfo = $usersModel->find($loggerUserID);
        $dataLogin = ['userinfo'=> $userInfo, 'loggerUserID' => $loggerUserID];
        $cateModel = new \App\Models\CateModel();
        $data['cate'] = $cateModel->findAll();