app/Controllers/CanvasController.php

    public function index()
    {
        // dd(current_url());
        $pageModel = new PageModel();

        $post = new PostModel;

        $cate = new CateModel;

        $featured = $post->join('cate', 'cate.id = post.post_cate_id', 'left')->select('cate.cate_name, cate.id, cate.cate_slug, post.*, post.id as p_id')->orderBy('post.id', 'DESC')->where('post_featured', 1)->limit(5)->find();

        $cate_all = $cate->where('cate_parent_id', 0)->where('cate_status', 1)->where('cate_type', 'normal')->find();
        // dd($cate_all);
        $cate_2 = $cate->findAll();
        $i = 0;
        foreach($cate_all as $key){
            $i++;
            $id = $key['id'];
            $cate_name[$i] = $key['cate_name'];
            foreach($cate_2 as $row){
                if($row['cate_parent_id'] == $id){
                    // $sub_id = array();
                    $sub_id[] = $row['id'];
                }

            }
            // dd($sub_id);
            if(isset($sub_id) && $sub_id != NULL){
                $post_cate[$i] = $post->orderBy('post.id', 'DESC')->whereIn('post_cate_id', $sub_id)->limit(5)->findAll();
---
SELECT `cate`.`cate_name`, `cate`.`id`, `cate`.`cate_slug`, `post`.*, `post`.`id` as `p_id`
FROM `post`
LEFT JOIN `cate` ON `cate`.`id` = `post`.`post_cate_id`
WHERE `post_featured` = 1
ORDER BY `post`.`id` DESC
 LIMIT 5
SELECT *
FROM `post`
WHERE `post_cate_id` IN ('8')
ORDER BY `post`.`id` DESC

        // $data['cate_all'] = $cate_all;
        // $data['post_cate'] = $post_cate;

        $page_home = $pageModel->where('page_status', 1)->first();
---
SELECT *
FROM `page`
WHERE `page_status` = 1
 LIMIT 1

                }
                $cate_sub_array[] = array_push($cate_sub_array, $cate_id);
                // dd($cate_sub_array);
                $post_cate = $post->select('cate.*, post.*, post.id as p_id')->whereIn('post_cate_id', $cate_sub_array)->join('cate', 'cate.id = post.post_cate_id', 'left')->orderBy('post.id', 'desc')->paginate($paginate);
                $post_count = $post->whereIn('post_cate_id', $cate_sub_array)->countAllResults();
                $most_view = $post->whereIn('post_cate_id', $cate_sub_array)->orderBy('post_view', 'DESC')->limit(4)->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `post`
LEFT JOIN `cate` ON `cate`.`id` = `post`.`post_cate_id`
WHERE `post_cate_id` = '18'
SELECT COUNT(*) AS `numrows`
FROM `post`
WHERE `post_cate_id` = '18'
SELECT *
FROM `post`
WHERE `post_cate_id` = '18'
ORDER BY `post_view` DESC



            }else{
                $post_cate = $post->select('cate.*, post.*, post.id as p_id')->where('post_cate_id', $cate_id)->join('cate', 'cate.id = post.post_cate_id', 'left')->orderBy('post.id', 'desc')->paginate($paginate);
                $post_count = $post->where('post_cate_id', $cate_id)->countAllResults();
                $most_view = $post->where('post_cate_id', $cate_id)->orderBy('post_view', 'DESC')->limit(4)->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `post`
LEFT JOIN `cate` ON `cate`.`id` = `post`.`post_cate_id`
WHERE `post_cate_id` IN ('8','1',2)
SELECT `cate`.*, `post`.*, `post`.`id` as `p_id`
FROM `post`
LEFT JOIN `cate` ON `cate`.`id` = `post`.`post_cate_id`
WHERE `post_cate_id` IN ('8','1',2)
ORDER BY `post`.`id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `post`
WHERE `post_cate_id` IN ('8','1',2)
SELECT *
FROM `post`
WHERE `post_cate_id` IN ('8','1',2)
ORDER BY `post_view` DESC


            }
        }else{
            $post_cate = $post->select('cate.*, post.*, post.id as p_id')->where('post_cate_id', $cate_id)->join('cate', 'cate.id = post.post_cate_id', 'left')->orderBy('post.id', 'desc')->paginate($paginate);
            $post_count = $post->where('post_cate_id', $cate_id)->countAllResults();
            $most_view = $post->where('post_cate_id', $cate_id)->orderBy('post_view', 'DESC')->limit(4)->findAll();
---
SELECT `cate`.*, `post`.*, `post`.`id` as `p_id`
FROM `post`
LEFT JOIN `cate` ON `cate`.`id` = `post`.`post_cate_id`
WHERE `post_cate_id` IN ('8','27','1',3)
ORDER BY `post`.`id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `post`
LEFT JOIN `cate` ON `cate`.`id` = `post`.`post_cate_id`
WHERE `post_cate_id` IN ('8','27','1',3)
SELECT *
FROM `post`
WHERE `post_cate_id` IN ('8','27','1',3)
ORDER BY `post_view` DESC
 LIMIT 4

    public function getPro(){
        $post = new PostModel;

        $cate = new CateModel;



        $paginate = 10;
        $pro_cate = $post->select('cate.*, post.*, post.id as p_id, cate.id as c_id')->where('post_status', 'san-pham')->join('cate', 'cate.id = post.post_cate_id', 'left')->orderBy('post.id', 'desc')->paginate($paginate);
                $pro_count = $post->where('post_status', 'san-pham')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `post`
LEFT JOIN `cate` ON `cate`.`id` = `post`.`post_cate_id`
WHERE `post_status` = 'san-pham'
SELECT `cate`.*, `post`.*, `post`.`id` as `p_id`, `cate`.`id` as `c_id`
FROM `post`
LEFT JOIN `cate` ON `cate`.`id` = `post`.`post_cate_id`
WHERE `post_status` = 'san-pham'
ORDER BY `post`.`id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `post`
WHERE `post_status` = 'san-pham'

    public function post($slug2, $title, $id){
        $post = new PostModel;
        $cate = new CateModel;
        $tag = new TagModel;


        $post_detail = $post->find($id);
        if(!$post_detail){
            return view('front_end/canvas_site/404');
        }
        $cate_detail = $cate->where('id', $post_detail['post_cate_id'])->first();

        $post_slug = $post_detail['post_slug'];
        $cate_slug = $cate_detail['cate_slug'];
        $post_id = $post_detail['id'];
        $tag_all = $tag->where('tag_post_id', $id)->find();

        // dd($tag_all);

        if($slug2 != $cate_slug || $title != $post_slug){
            return redirect()->to(base_url().'/'.$cate_slug.'/'.$post_slug.'-'.$post_id.'.html');
        }

        $related_1 = $post->join('cate', 'cate.id = post.post_cate_id', 'left')->orderBy('post.id', 'DESC')->select('cate.cate_slug, post.*')->groupStart()->where('post_cate_id', $cate_detail['id'])->where('post.id <', $id)->groupEnd()->limit(3)->findAll();
        $related_2 = $post->join('cate', 'cate.id = post.post_cate_id', 'left')->orderBy('post.id', 'DESC')->select('cate.cate_slug, post.*')->groupStart()->where('post_cate_id', $cate_detail['id'])->where('post.id >', $id)->groupEnd()->limit(3)->findAll();
        $related = array_merge($related_1, $related_2);


        $previous = $post->orderBy('id', 'desc')->where('id <', $id)->first();
        $next = $post->orderBy('id', 'desc')->where('id >', $id)->first();
        $most_view_this_cate = $post->join('cate', 'cate.id = post.post_cate_id', 'left')->orderBy('post.post_view', 'DESC')->select('cate.cate_slug, post.*')->groupStart()->where('post_cate_id', $cate_detail['id'])->where('post.id !=', $id)->groupEnd()->limit(6)->findAll();
---
SELECT *
FROM `post`
WHERE `post`.`id` = '24'
SELECT *
FROM `cate`
WHERE `id` = '8'
 LIMIT 1
SELECT `cate`.`cate_slug`, `post`.*
FROM `post`
LEFT JOIN `cate` ON `cate`.`id` = `post`.`post_cate_id`
WHERE   (
`post_cate_id` = '8'
AND `post`.`id` < '24'
 )
ORDER BY `post`.`id` DESC
SELECT `cate`.`cate_slug`, `post`.*
FROM `post`
LEFT JOIN `cate` ON `cate`.`id` = `post`.`post_cate_id`
WHERE   (
`post_cate_id` = '8'
AND `post`.`id` != '24'
 )
ORDER BY `post`.`post_view` DESC

    public function getSearch(){

        $post = new PostModel;

        $key = $_GET['q'];
        $paginate = 10;
        // dd($key);
        if(!isset($key) || $key == null || $key == '+' || $key == '++'){
            return view('front_end/canvas_site/404');
        }

        $array = ['post_title' => $key, 'post_intro' => $key, 'post_content' => $key];
        $result = $post->join('cate', 'cate.id = post.post_cate_id', 'left')->select('cate.cate_slug, post.post_slug, post.id, post.post_title, post.post_intro, post.updated_at, post.created_at, post.post_content')->like($array)->paginate($paginate);
---
SELECT `cate`.`cate_slug`, `post`.*
FROM `post`
LEFT JOIN `cate` ON `cate`.`id` = `post`.`post_cate_id`
WHERE   (
`post_cate_id` = '27'
AND `post`.`id` < '57'
 )
ORDER BY `post`.`id` DESC
 LIMIT 3