app/Controllers/CanvasController.php

    public function getProd(){
        $post = new PostModel;

        $cate = new CateModel;

        $postImage = new PostImagesModel();



        $paginate = 10;
        $pro_cate = $post->select('cate.*, post.*, post.id as p_id, cate.id as c_id')->where('post_status', 'san-pham')->join('cate', 'cate.id = post.post_cate_id', 'left')->orderBy('post.id', 'desc')->paginate($paginate);
                $pro_count = $post->where('post_status', 'san-pham')->countAllResults();

        if($pro_cate != null){
            foreach($pro_cate as $value){
                $pi_id = array();
                $pi_id[] = $value['p_id'];
            }


            if($postImage->whereIn('post_image_id', $pi_id)->findAll()){
---
SELECT *
FROM `post_images`
WHERE `post_image_id` IN ('42','41')

    public function tag($tag_slug, $tag_id){


        $post = new PostModel;

        $tag = new TagModel;

        $paginate = 10;

        $tag_detail = $tag->where('tag_post_slug', $tag_slug)->select('tag.tag_post_id, tag.tag_post_title, tag.created_at, tag.updated_at')->findAll();
        // dd($tag_detail);

        if(!isset($tag_detail) || $tag_detail == null){
            $data['error'] = "Tag không tồn tại hoặc không đúng hoặc không liên kết với bài viết nào";
            return view('front_end/canvas_site/404', $data);
        }

        foreach($tag_detail as $key5){
            $post_id_array[] = $key5['tag_post_id'];
        }

        // dd($post_id_array);

        $post_tag = $post->whereIn('post.id', $post_id_array)->join('cate', 'cate.id = post.post_cate_id', 'left')->select('cate.cate_slug, post.*')->orderBy('post.id', 'DESC')->paginate($paginate);
---
SELECT `tag`.`tag_post_id`, `tag`.`tag_post_title`, `tag`.`created_at`, `tag`.`updated_at`
FROM `tag`
WHERE `tag_post_slug` = 'tag-5'
SELECT COUNT(*) AS `numrows`
FROM `post`
LEFT JOIN `cate` ON `cate`.`id` = `post`.`post_cate_id`
WHERE `post`.`id` IN ('33')
SELECT `cate`.`cate_slug`, `post`.*
FROM `post`
LEFT JOIN `cate` ON `cate`.`id` = `post`.`post_cate_id`
WHERE `post`.`id` IN ('33')
ORDER BY `post`.`id` DESC
 LIMIT 10