app/Controllers/MayMocController.php

    public function index()
    {
        // dd(current_url());
        $pageModel = new PageModel();

        $post = new PostModel;

        $cate = new CateModel;

        $session = session();
        $session->set('cate_current', null);

        $featured = $post->join('cate', 'cate.id = post.post_cate_id', 'left')->select('cate.cate_name, cate.id, cate.cate_slug, post.*, post.id as p_id')->orderBy('post.id', 'DESC')->where('post_featured', 1)->limit(5)->find();
---
SELECT `cate`.`cate_name`, `cate`.`id`, `cate`.`cate_slug`, `post`.*, `post`.`id` as `p_id`
FROM `post`
LEFT JOIN `cate` ON `cate`.`id` = `post`.`post_cate_id`
WHERE `post_featured` = 1
ORDER BY `post`.`id` DESC
 LIMIT 5

            }
            // dd($sub_id);
            if(isset($sub_id) && $sub_id != NULL){
                $post_cate[$i] = $post->orderBy('post.id', 'DESC')->whereIn('post_cate_id', $sub_id)->limit(5)->find();
---
SELECT *
FROM `post`
WHERE `post_cate_id` IN ('8','27')
ORDER BY `post`.`id` DESC
 LIMIT 5

        $gallery_home  = $gallery->orderBy('id', 'DESC')->limit(4)->find();


        $page_home = $pageModel->where('page_status', 1)->first();
---
SELECT *
FROM `page`
WHERE `page_status` = 1
 LIMIT 1